ArduPilot/ardupilot/modules/ChibiOS/os/common/ext/ST/STM32U5xx/stm32u5g7xx.h
/****************  Bit definition for XSPI_CALMR register  *******************/
#define XSPI_HSPI_CALMR_FINE_Pos          (0U)
#define XSPI_HSPI_CALMR_FINE_Msk          (0x7FUL << XSPI_HSPI_CALMR_FINE_Pos)            /*!< 0x0000007F */
#define XSPI_HSPI_CALMR_FINE              XSPI_HSPI_CALMR_FINE_Msk                        /*!< Fine Calibration only for HSPI, Invalid for OCTOSPI */
#define XSPI_HSPI_CALMR_COARSE_Pos        (16U)
#define XSPI_HSPI_CALMR_COARSE_Msk        (0x1FUL << XSPI_HSPI_CALMR_COARSE_Pos)          /*!< 0x001F0000 */
#define XSPI_HSPI_CALMR_COARSE            XSPI_HSPI_CALMR_COARSE_Msk                      /*!< Coarse Calibration only for HSPI, Invalid for OCTOSPI */

/****************  Bit definition for XSPI_CALSOR register  ******************/
#define XSPI_HSPI_CALSOR_FINE_Pos         (0U)
#define XSPI_HSPI_CALSOR_FINE_Msk         (0x7FUL << XSPI_HSPI_CALSOR_FINE_Pos)           /*!< 0x0000007F */
#define XSPI_HSPI_CALSOR_FINE             XSPI_HSPI_CALSOR_FINE_Msk                       /*!< Fine Calibration only for HSPI, Invalid for OCTOSPI */
#define XSPI_HSPI_CALSOR_COARSE_Pos       (16U)
#define XSPI_HSPI_CALSOR_COARSE_Msk       (0x1FUL << XSPI_HSPI_CALSOR_COARSE_Pos)         /*!< 0x001F0000 */
#define XSPI_HSPI_CALSOR_COARSE           XSPI_HSPI_CALSOR_COARSE_Msk                     /*!< Coarse Calibration only for HSPI, Invalid for OCTOSPI */

/****************  Bit definition for XSPI_CALSIR register  ******************/
#define XSPI_HSPI_CALSIR_FINE_Pos        (0U)
#define XSPI_HSPI_CALSIR_FINE_Msk        (0x7FUL << XSPI_HSPI_CALSIR_FINE_Pos)            /*!< 0x0000007F */
#define XSPI_HSPI_CALSIR_FINE            XSPI_HSPI_CALSIR_FINE_Msk                        /*!< Fine Calibration only for HSPI, Invalid for OCTOSPI */
#define XSPI_HSPI_CALSIR_COARSE_Pos      (16U)
#define XSPI_HSPI_CALSIR_COARSE_Msk      (0x1FUL << XSPI_HSPI_CALSIR_COARSE_Pos)          /*!< 0x001F0000 */
#define XSPI_HSPI_CALSIR_COARSE          XSPI_HSPI_CALSIR_COARSE_Msk                      /*!< Coarse Calibration only for HSPI, Invalid for OCTOSPI */

/******************************************************************************/
/*                                                                            */
/*                                    OCTOSPI                                 */
/*                                                                            */
/******************************************************************************/
/*****************  Bit definition for OCTOSPI_CR register  *******************/
#define OCTOSPI_CR_EN_Pos                   XSPI_CR_EN_Pos
#define OCTOSPI_CR_EN_Msk                   XSPI_CR_EN_Msk                                /*!< 0x00000001 */
#define OCTOSPI_CR_EN                       XSPI_CR_EN                                    /*!< Enable */
#define OCTOSPI_CR_ABORT_Pos                XSPI_CR_ABORT_Pos
#define OCTOSPI_CR_ABORT_Msk                XSPI_CR_ABORT_Msk                             /*!< 0x00000002 */
#define OCTOSPI_CR_ABORT                    XSPI_CR_ABORT                                 /*!< Abort request */
#define OCTOSPI_CR_DMAEN_Pos                XSPI_CR_DMAEN_Pos
#define OCTOSPI_CR_DMAEN_Msk                XSPI_CR_DMAEN_Msk                             /*!< 0x00000004 */
#define OCTOSPI_CR_DMAEN                    XSPI_CR_DMAEN                                 /*!< DMA Enable */
#define OCTOSPI_CR_TCEN_Pos                 XSPI_CR_TCEN_Pos
#define OCTOSPI_CR_TCEN_Msk                 XSPI_CR_TCEN_Msk                              /*!< 0x00000008 */
#define OCTOSPI_CR_TCEN                     XSPI_CR_TCEN                                  /*!< Timeout Counter Enable */
#define OCTOSPI_CR_DMM_Pos                  XSPI_CR_DMM_Pos
#define OCTOSPI_CR_DMM_Msk                  XSPI_CR_DMM_Msk                               /*!< 0x00000040 */
#define OCTOSPI_CR_DMM                      XSPI_CR_DMM                                   /*!< Dual Memory Mode */
#define OCTOSPI_CR_MSEL_Pos                 XSPI_OCTOSPI_CR_MSEL_Pos
#define OCTOSPI_CR_MSEL_Msk                 XSPI_OCTOSPI_CR_MSEL_Msk                      /*!< 0x00000080 */
#define OCTOSPI_CR_MSEL                     XSPI_OCTOSPI_CR_MSEL                          /*!< Memory Select */
#define OCTOSPI_CR_FTHRES_Pos               XSPI_CR_FTHRES_Pos
#define OCTOSPI_CR_FTHRES_Msk               (0x1FUL << OCTOSPI_CR_FTHRES_Pos)             /*!< 0x00001F00 */
#define OCTOSPI_CR_FTHRES                   XSPI_CR_FTHRES                                /*!< FIFO Threshold Level */
#define OCTOSPI_CR_TEIE_Pos                 XSPI_CR_TEIE_Pos
#define OCTOSPI_CR_TEIE_Msk                 XSPI_CR_TEIE_Msk                              /*!< 0x00010000 */
#define OCTOSPI_CR_TEIE                     XSPI_CR_TEIE                                  /*!< Transfer Error Interrupt Enable */
#define OCTOSPI_CR_TCIE_Pos                 XSPI_CR_TCIE_Pos
#define OCTOSPI_CR_TCIE_Msk                 XSPI_CR_TCIE_Msk                              /*!< 0x00020000 */
#define OCTOSPI_CR_TCIE                     XSPI_CR_TCIE                                  /*!< Transfer Complete Interrupt Enable */
#define OCTOSPI_CR_FTIE_Pos                 XSPI_CR_FTIE_Pos
#define OCTOSPI_CR_FTIE_Msk                 XSPI_CR_FTIE_Msk)                             /*!< 0x00040000 */
#define OCTOSPI_CR_FTIE                     XSPI_CR_FTIE                                  /*!< FIFO Threshold Interrupt Enable */
#define OCTOSPI_CR_SMIE_Pos                 XSPI_CR_SMIE_Pos
#define OCTOSPI_CR_SMIE_Msk                 XSPI_CR_SMIE_Msk                              /*!< 0x00080000 */
#define OCTOSPI_CR_SMIE                     XSPI_CR_SMIE                                  /*!< Status Match Interrupt Enable */
#define OCTOSPI_CR_TOIE_Pos                 XSPI_CR_TOIE_Pos
#define OCTOSPI_CR_TOIE_Msk                 XSPI_CR_TOIE_Msk                              /*!< 0x00100000 */
#define OCTOSPI_CR_TOIE                     XSPI_CR_TOIE                                  /*!< TimeOut Interrupt Enable */
#define OCTOSPI_CR_APMS_Pos                 XSPI_CR_APMS_Pos
#define OCTOSPI_CR_APMS_Msk                 XSPI_CR_APMS_Msk                              /*!< 0x00400000 */
#define OCTOSPI_CR_APMS                     XSPI_CR_APMS                                  /*!< Automatic Poll Mode Stop */
#define OCTOSPI_CR_PMM_Pos                  XSPI_CR_PMM_Pos
#define OCTOSPI_CR_PMM_Msk                  XSPI_CR_PMM_Msk                               /*!< 0x00800000 */
#define OCTOSPI_CR_PMM                      XSPI_CR_PMM                                   /*!< Polling Match Mode */
#define OCTOSPI_CR_FMODE_Pos                XSPI_CR_FMODE_Pos
#define OCTOSPI_CR_FMODE_Msk                XSPI_CR_FMODE_Msk                             /*!< 0x30000000 */
#define OCTOSPI_CR_FMODE                    XSPI_CR_FMODE                                 /*!< Functional Mode */
#define OCTOSPI_CR_FMODE_0                  XSPI_CR_FMODE_0                               /*!< 0x10000000 */
#define OCTOSPI_CR_FMODE_1                  XSPI_CR_FMODE_1                               /*!< 0x20000000 */

/* Legacy Bit definition for OCTOSPI_CR register */
#define OCTOSPI_CR_DQM                      XSPI_CR_DMM                                   /*!< Legacy Dual Memory Mode */
#define OCTOSPI_CR_FSEL                     XSPI_OCTOSPI_CR_MSEL                          /*!< Legacy Memory Select */

